# отрисовка поля

def draw_area():
    for i in area:
        print(*i)
    print()

# проверка победителя

def check_winner():
    nul, X = 0, 0
    for i in range(1, 4): # Берем строки поочередно
        for j in range(1, 4): # В каждой строке пробегаем по значениям с 1 индекса, так как в нулевом у нас номер столбца
            if area[i][j] == '0 ': # считаем количество '0'
                nul += 1
            elif area[i][j] == 'X ': # считаем количество 'X'
                X += 1
        if nul == 3: # Если нолей 3 то передаем значение '0' в программу
            return '0'
        elif X == 3:
            return 'X' # Если иксов 3 то передаем значение 'Х' в программу

        nul, X = 0, 0 # обнуляем значения nul и X для следующей строки
    # тут то же самое (подсчет иксов и нулей, только для столбцов)
    for i in range(1, 4):
        for j in range(1, 4):
            if area[j][i] == '0 ':
                nul += 1
            elif area[j][i] == 'X ':
                X += 1
        if nul == 3:
            return '0'
        elif X == 3:
            return 'X'
        nul, X = 0, 0

    # Проверка выйгрыша по диагоналям

    if area[1][1] == 'X ' and area[2][2] == 'X ' and area[3][3] == 'X ':
        return 'X'
    if area[1][1] == '0 ' and area[2][2] == '0 ' and area[3][3] == '0 ':
        return '0'
    if area[1][3] == 'X ' and area[2][2] == 'X ' and area[3][1] == 'X ':
        return 'X'
    if area[1][3] == '0 ' and area[2][2] == '0 ' and area[3][1] == '0 ':
        return '0'

# Тело игры
# Объявляем необходимые переменные

cell = '1'
cells = [1, 2, 3]
cross = 0
zero = 0
draw = 0
area = [["  ", "1 ", "2 ", "3 "], ["1 ", "* ", "* ", "* "], ["2 ", "* ", "* ", "* "], ["3 ", "* ", "* ", "* "]]
game = '1'

# запускаем цикл для возможности повторить игру и подсчитать кол-во побед и ничьих
while game == '1':
    print('Добро пожаловать в игру "Крестики - нолики"') # Приветствие
    print('-------------------------------------------')
    draw_area() # Вызываем функцию отрисовки игрового поля поля
    for turn in range(1, 10): # запускаем цикл ходов. Всего 9 ходов !!!!!!!!! Исправить, ходов может быть больше 9

        print(f'Ход: {turn}') # Выводим инфу о текущем ходе
        if turn % 2 == 0: # проверяем четность хода. Если ход нечетный, ходит крестик
            turn_char = '0 ' # присваиваем знак для хода
            print('Ходит Нолик')
        else:
            turn_char = 'X '
            print('Ходит Крестик')
        while cell == '1': # просим игорька ввести номер строки и столбца. Если он выходит за рамки поля, нужно повторить ввод
            row = int(input('Введите номер строки (1, 2, 3) - '))
            column = int(input('Введите номер столбца (1, 2, 3) - '))
            if row in cells and column in cells:
                cell = '0'
            else:
                print(f'Одно из чисел {row} или {column} выходит за диапазон поля')
        cell = '1'
        if area[row][column] == '* ': # проверяем что поле уже не занято иксом или нолем
            area[row][column] = turn_char # ставим знак
        else:
            print('Ячейка уже занята, Вы пропускаете ход! :(')
            draw_area()
            continue
        draw_area()
        # Проверяем поле на ситуацию выйгрыша.
        if check_winner() =='X': # Вызываем фугкцию проверки победителя
            print('Победили Крестики!!!')
            cross += 1 # добавляем один в счетчик победителя
            game = input('Еще разок? (1 - да, 0 - нет). Выш выбор - ') # Продолжаем играть или останавливаем цикл игры
            area = [["  ", "1 ", "2 ", "3 "], ["1 ", "* ", "* ", "* "], ["2 ", "* ", "* ", "* "],
                    ["3 ", "* ", "* ", "* "]]
            break
        if check_winner() =='0':
            print('Победили Нолики!!!')
            zero += 1
            game = input('Еще разок? (1 - да, 0 - нет). Выш выбор - ')
            area = [["  ", "1 ", "2 ", "3 "], ["1 ", "* ", "* ", "* "], ["2 ", "* ", "* ", "* "],
                    ["3 ", "* ", "* ", "* "]]
            break
        if check_winner() !='X' and check_winner() !='0' and turn == 9:
            print('Ничья!!!')
            draw += 1
            game = input('Еще разок? (1 - да, 0 - нет). Выш выбор - ')
            area = [["  ", "1 ", "2 ", "3 "], ["1 ", "* ", "* ", "* "], ["2 ", "* ", "* ", "* "],
                    ["3 ", "* ", "* ", "* "]]
            break
print(f'------------------------------')
print(f'Игра окончена! Ваши результаты')
print(f'Побед Крестиков - {cross}, Побед Ноликов - {zero}, Ничьих - {draw}')